*Import required packages*

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
#READ THE DATA
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [7]:
#file folder 
#file name
#file extention
df=pd.read_csv("C:\\Users\\SHWETA BHOYAR\\OneDrive\\Documents\\New folder\\Omkar sir PYTHON\\Full Stack Data Science @ 7_15 AM _ Mr.Omkar [6th Dec] Mr.Omkar-20231223T183622Z-001\\Excel data set\Visadataset.csv")

In [8]:
df.head()
# your name of the data frame: visa_df
# <package name>.<method name>
# It will return top-5

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [10]:
df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [11]:
df.shape
# shape : (m,n) (rows,columns)
# Number of rows are 25480
# Number of column are 12

(25480, 12)

In [13]:
type(df.shape)

tuple

In [17]:
df.shape[0],df.shape[1]
print('The number of rows are:',df.shape[0])
print('The number of columns are',df.shape[1])

The number of rows are: 25480
The number of columns are 12

In [18]:
type(df)

pandas.core.frame.DataFrame

*size*

In [21]:
df.size #rows * columns

305760

In [22]:
len(df)

25480

*Columns*

In [23]:
cols=df.columns
cols
# It will provide all 12 columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [24]:
type(df.columns)

pandas.core.indexes.base.Index

In [25]:
cols_list=cols.to_list()
type(cols_list)

list

In [26]:
# Select cell
# CTRL+A
# CTRL+/
# cols=visa_df.columns
# for i in cols:
# print(i.capitalize())

*dtypes*

In [27]:
df.dtypes
# Object : the values under that column are categorical
# Int/float : The values under that column are numerical
# 1 2 4 8 16 32 64 128 256

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [28]:
type(df.dtypes)

pandas.core.series.Series

*info*

In [29]:
df.info()
# Caseid 25400
# out of 25480 rows 80 values are missed: Null
# Null count 80
# Non Null count 25400

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

In [30]:
df.isna().sum()
# visa_df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

- Read the csv file
- head
- tail
- shape
- size
- len
- columns
- dtypes
- info
- isnull

*Not callable*
    
    - It is not a function but you provided brackets
    - Remove those brackets
*Bound method or built in function*
    - Please provide brackets
- Attribute Error
    - You provided a method which does not have
    - Please check the spelling
    - or use dir to check the method existed or not

In [31]:
df.dtypes
# I want to seperate categorical columns and numerical columns
# Idea: Convert this into dictionary
dtype=dict(df.dtypes)
# for i in dtype:
# if dtype[i]=='object':
# print(i,dtype[i])
cat_col=[i for i in dtype if dtype[i]=='object']
num_col=[i for i in dtype if dtype[i]!='object']
cat_col,num_col

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [34]:
file_loc="C:\\Users\\SHWETA BHOYAR\\OneDrive\\Documents\\New folder\\Omkar sir PYTHON\\Full Stack Data Science @ 7_15 AM _ Mr.Omkar [6th Dec] Mr.Omkar-20231223T183622Z-001\\Excel data set\Visadataset.csv"

In [38]:
df=pd.read_csv(file_loc)
df
df.dtypes
dtypes=dict(df.dtypes)

In [40]:
#visa df.select_dtypes(include='object'): DataFrame
df.select_dtypes(include='object').columns
df.select_dtypes(exclude='object').columns

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

In [47]:
df.dtypes
dtype=dict(df.dtypes)
cat_col=[i for i in dtype if dtype[i]=='object']
num_col=[i for i in dtype if dtype[i]!='object']
cat_col,num_col

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [49]:
#head: first 5 rows
#tail: last 5 rows
# you want same middle rows
#you want specific rows
# you want some  specific columns data

take-loc-iloc

In [51]:
df.take([1,2,3])
#by default axis =0 ===rows
#provide the rows which has index =1,2,3 and all the columns

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.65,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.86,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.03,Year,Y,Denied

In [53]:
df.take([1,2,3,4,5,6],axis=1)

,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab
0,Asia,High School,N,N,14513,2007
1,Asia,Master's,Y,N,2412,2002
2,Asia,Bachelor's,N,Y,44444,2008
3,Asia,Bachelor's,N,N,98,1897
4,Africa,Master's,Y,N,1082,2005
...,...,...,...,...,...,...
25475,Asia,Bachelor's,Y,Y,2601,2008
25476,Asia,High School,Y,N,3274,2006
25477,Asia,Master's,Y,N,1121,1910
25478,Asia,Master's,Y,Y,1918,1887
25479,Asia,Bachelor's,Y,N,3195,1960

In [57]:
df.take([1,2,3])
df.take([1,2,3],axis=1)
df.take([100,200,300]).take([2,3],axis=1)

    education_of_employee has_job_experience
100              Master's                  Y
200             Doctorate                  Y
300              Master's                  Y

- Quick checks
- type : list ==== methods
string === str methods
dict === dict methods
index ==== has some methods==== convert into other
- head/tail/shape/size/len
- columns/dtypes/info
- cat and num
- take based on axis either rows or columns

iloc

In [58]:
#whenever you open jupyter notebook
# please read the package and dataframe again

In [59]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:

file_loc=pd.read_csv("C:\\Users\\SHWETA BHOYAR\\OneDrive\\Documents\\New folder\\Omkar sir PYTHON\\Full Stack Data Science @ 7_15 AM _ Mr.Omkar [6th Dec] Mr.Omkar-20231223T183622Z-001\\Excel data set\Visadataset.csv")

In [60]:
df=pd.read_csv(file_loc)
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

- visa_df.iloc[<rows>,<columns>]
- visa_df.iloc[<start:end>,<start:end>]
- visa_df.iloc[[rows index],[columns index]]

In [63]:
df.iloc[5:10,2:6]
#i want select rows has index 5 to 9
#i want select columns  has index 2 to 5

,education_of_employee,has_job_experience,requires_job_training,no_of_employees
5,Master's,Y,N,2339
6,Bachelor's,N,N,4985
7,Bachelor's,Y,N,3035
8,Bachelor's,N,N,4810
9,Doctorate,Y,N,2251

In [64]:
df.iloc[5:10],
df.iloc[5:10,:]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
5,EZYV06,Asia,Master's,Y,N,2339,2012,South,78252.1400,Year,Y,Certified
6,EZYV07,Asia,Bachelor's,N,N,4985,1994,South,53635.3900,Year,Y,Certified
7,EZYV08,North America,Bachelor's,Y,N,3035,1924,West,418.2298,Hour,Y,Denied
8,EZYV09,Asia,Bachelor's,N,N,4810,2012,Midwest,74362.1900,Year,Y,Certified
9,EZYV10,Europe,Doctorate,Y,N,2251,1995,South,67514.7600,Year,Y,Certified

In [65]:
df.iloc[:,:2]

         case_id continent
0         EZYV01      Asia
1         EZYV02      Asia
2         EZYV03      Asia
3         EZYV04      Asia
4         EZYV05    Africa
...          ...       ...
25475  EZYV25476      Asia
25476  EZYV25477      Asia
25477  EZYV25478      Asia
25478  EZYV25479      Asia
25479  EZYV25480      Asia

[25480 rows x 2 columns]

In [66]:
df.iloc[5:10,2:6] # 5 to 9 index rows , 2 to 5 index columns
df.iloc[5:10,:] # All the columns , 5 to 9 index rows
df.iloc[:,:2] # All the rows only 0 and 1 column

         case_id continent
0         EZYV01      Asia
1         EZYV02      Asia
2         EZYV03      Asia
3         EZYV04      Asia
4         EZYV05    Africa
...          ...       ...
25475  EZYV25476      Asia
25476  EZYV25477      Asia
25477  EZYV25478      Asia
25478  EZYV25479      Asia
25479  EZYV25480      Asia

[25480 rows x 2 columns]

In [68]:
rows=[100,200,300]
cols=[2,7]
df.iloc[rows,cols]

    education_of_employee region_of_employment
100              Master's            Northeast
200             Doctorate                 West
300              Master's              Midwest

In [69]:
cols=[2,7]
df.iloc[100:103,cols]

    education_of_employee region_of_employment
100              Master's            Northeast
101              Master's              Midwest
102            Bachelor's              Midwest

In [70]:
rows=[100,200,300]
cols=['education_of_employee','region_of_employment']
df.loc[rows,cols]

    education_of_employee region_of_employment
100              Master's            Northeast
200             Doctorate                 West
300              Master's              Midwest

- iloc takes only numerical entry, we can not provide column names directly
- loc takes only column names